import React from "react";

function Map() {
  return (
    <div className="lg:px-10 pb-10 @container">
      <div id="contacts" className="bg-gray-100  rounded-3xl">
        <div
          id="addresses"
          className="flex flex-col-reverse @min-[500px]:grid grid-cols-2 @min-[960px]:grid-cols-4  grid-rows-4 @min-[960px]:grid-rows-2 gap-2 xl:gap-3 2xl:gap-6 "
        >
          <div className="@min-[500px]:block hidden mb-8   pt-8 ps-8">
            <h3 className="text-3xl xl:text-4xl 2xl:text-5xl font-[Open-Sans] font-medium">
              Контакты
            </h3>
          </div>
          <div className="@min-[500px]:block hidden sm:text-xl md:text-2xl lg:text-xl 2xl:text-2xl  bg-slate-200 z-50  @min-[960px]:px-3 p-4 @min-[630px]:p-6  @min-[700px]:p-8 @min-[960px]:py-4 @min-[1000px]:px-4 @min-[1270px]:px-5 @min-[1440px]:px-10 @min-[1550px]:px-12 @min-[1700px]:px-16  @min-[1780px]:px-18 @min-[1000px]:py-4 @min-[1200px]:py-4 @min-[1400px]:py-8 @min-[1550px]:py-10 @min-[1680px]:py-14">
            <h3 className="font-[Open-Sans] text-2xl text-sky-800 text-slate 2xl:text-3xl mb-5">
              Черняховск
            </h3>
            <h4 className=" sm:text-xl lg:text-base xl:text-lg 2xl:text-xl mb-2">
              Калининградская область, Черняховск, Калининградская
              улица,&nbsp;14Б
            </h4>
            <a href="tel:4014135402">
              <div className="mb-2 mt-5">
                {" "}
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  viewBox="0 0 640 640"
                  className="inline w-6 mb-1 me-1"
                >
                  <path d="M224.2 89C216.3 70.1 195.7 60.1 176.1 65.4L170.6 66.9C106 84.5 50.8 147.1 66.9 223.3C104 398.3 241.7 536 416.7 573.1C493 589.3 555.5 534 573.1 469.4L574.6 463.9C580 444.2 569.9 423.6 551.1 415.8L453.8 375.3C437.3 368.4 418.2 373.2 406.8 387.1L368.2 434.3C297.9 399.4 241.3 341 208.8 269.3L253 233.3C266.9 222 271.6 202.9 264.8 186.3L224.2 89z" />
                </svg>{" "}
                4014 13 54 02
              </div>
            </a>
            <a href="https://wa.me/+79097753077">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 640 640"
                className="w-8 mb-1 me-1 inline"
              >
                <path d="M476.9 161.1C435 119.1 379.2 96 319.9 96C197.5 96 97.9 195.6 97.9 318C97.9 357.1 108.1 395.3 127.5 429L96 544L213.7 513.1C246.1 530.8 282.6 540.1 319.8 540.1L319.9 540.1C442.2 540.1 544 440.5 544 318.1C544 258.8 518.8 203.1 476.9 161.1zM319.9 502.7C286.7 502.7 254.2 493.8 225.9 477L219.2 473L149.4 491.3L168 423.2L163.6 416.2C145.1 386.8 135.4 352.9 135.4 318C135.4 216.3 218.2 133.5 320 133.5C369.3 133.5 415.6 152.7 450.4 187.6C485.2 222.5 506.6 268.8 506.5 318.1C506.5 419.9 421.6 502.7 319.9 502.7zM421.1 364.5C415.6 361.7 388.3 348.3 383.2 346.5C378.1 344.6 374.4 343.7 370.7 349.3C367 354.9 356.4 367.3 353.1 371.1C349.9 374.8 346.6 375.3 341.1 372.5C308.5 356.2 287.1 343.4 265.6 306.5C259.9 296.7 271.3 297.4 281.9 276.2C283.7 272.5 282.8 269.3 281.4 266.5C280 263.7 268.9 236.4 264.3 225.3C259.8 214.5 255.2 216 251.8 215.8C248.6 215.6 244.9 215.6 241.2 215.6C237.5 215.6 231.5 217 226.4 222.5C221.3 228.1 207 241.5 207 268.8C207 296.1 226.9 322.5 229.6 326.2C232.4 329.9 268.7 385.9 324.4 410C359.6 425.2 373.4 426.5 391 423.9C401.7 422.3 423.8 410.5 428.4 397.5C433 384.5 433 373.4 431.6 371.1C430.3 368.6 426.6 367.2 421.1 364.5z" />
              </svg>
              8 909 775 30 77
            </a>
            <div className=" sm:text-lg lg:text-base xl:text-lg 2xl:text-xl mt-10">
              <div className="">
                Часы работы с&nbsp;8:00&nbsp;до&nbsp;18:00{" "}
              </div>
              <div className="sm:text-lg lg:text-base xl:text-xl">
                Воскресенье - выходной
              </div>
            </div>
          </div>

          <div className="w-full h-full col-span-2 rounded-tr-3xl overflow-hidden  mb-3 @min-[500px]:mb-0">
            <iframe
              className="w-full h-full  min-h-90 @min-[510px]:min-h-px z-50"
              src="https://yandex.ru/map-widget/v1/?um=constructor%3A6c3610ebf9b8aaf9b8546d960361f445954a0f6ae8d04c9367b69681a1f9d2db&amp;source=constructor"
              frameborder="0"
            ></iframe>
          </div>
          <div className="@min-[500px]:hidden  sm:text-xl md:text-2xl lg:text-xl 2xl:text-2xl  bg-slate-200 z-50  @min-[960px]:px-3 p-4 @min-[630px]:p-6  @min-[700px]:p-8 @min-[960px]:py-4 @min-[1000px]:px-4 @min-[1270px]:px-5 @min-[1440px]:px-10 @min-[1550px]:px-12 @min-[1700px]:px-16  @min-[1780px]:px-18 @min-[1000px]:py-4 @min-[1200px]:py-4 @min-[1400px]:py-8 @min-[1550px]:py-10 @min-[1680px]:py-14">
            <h3 className="font-[Open-Sans] text-2xl text-sky-800 text-slate 2xl:text-3xl mb-5">
              Черняховск
            </h3>
            <h4 className=" sm:text-xl lg:text-base xl:text-lg 2xl:text-xl mb-2">
              Калининградская область, Черняховск, Калининградская
              улица,&nbsp;14Б
            </h4>{" "}
            <a href="tel:4014135402">
              <div className="mb-2 mt-5">
                {" "}
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  viewBox="0 0 640 640"
                  className="inline w-6 mb-1 me-1"
                >
                  <path d="M224.2 89C216.3 70.1 195.7 60.1 176.1 65.4L170.6 66.9C106 84.5 50.8 147.1 66.9 223.3C104 398.3 241.7 536 416.7 573.1C493 589.3 555.5 534 573.1 469.4L574.6 463.9C580 444.2 569.9 423.6 551.1 415.8L453.8 375.3C437.3 368.4 418.2 373.2 406.8 387.1L368.2 434.3C297.9 399.4 241.3 341 208.8 269.3L253 233.3C266.9 222 271.6 202.9 264.8 186.3L224.2 89z" />
                </svg>{" "}
                4014 13 54 02
              </div>
            </a>
            <a href="https://wa.me/+79097753077">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 640 640"
                className="w-8 mb-1 me-1 inline"
              >
                <path d="M476.9 161.1C435 119.1 379.2 96 319.9 96C197.5 96 97.9 195.6 97.9 318C97.9 357.1 108.1 395.3 127.5 429L96 544L213.7 513.1C246.1 530.8 282.6 540.1 319.8 540.1L319.9 540.1C442.2 540.1 544 440.5 544 318.1C544 258.8 518.8 203.1 476.9 161.1zM319.9 502.7C286.7 502.7 254.2 493.8 225.9 477L219.2 473L149.4 491.3L168 423.2L163.6 416.2C145.1 386.8 135.4 352.9 135.4 318C135.4 216.3 218.2 133.5 320 133.5C369.3 133.5 415.6 152.7 450.4 187.6C485.2 222.5 506.6 268.8 506.5 318.1C506.5 419.9 421.6 502.7 319.9 502.7zM421.1 364.5C415.6 361.7 388.3 348.3 383.2 346.5C378.1 344.6 374.4 343.7 370.7 349.3C367 354.9 356.4 367.3 353.1 371.1C349.9 374.8 346.6 375.3 341.1 372.5C308.5 356.2 287.1 343.4 265.6 306.5C259.9 296.7 271.3 297.4 281.9 276.2C283.7 272.5 282.8 269.3 281.4 266.5C280 263.7 268.9 236.4 264.3 225.3C259.8 214.5 255.2 216 251.8 215.8C248.6 215.6 244.9 215.6 241.2 215.6C237.5 215.6 231.5 217 226.4 222.5C221.3 228.1 207 241.5 207 268.8C207 296.1 226.9 322.5 229.6 326.2C232.4 329.9 268.7 385.9 324.4 410C359.6 425.2 373.4 426.5 391 423.9C401.7 422.3 423.8 410.5 428.4 397.5C433 384.5 433 373.4 431.6 371.1C430.3 368.6 426.6 367.2 421.1 364.5z" />
              </svg>
              8 909 775 30 77
            </a>
            <div className=" sm:text-lg lg:text-base xl:text-lg 2xl:text-xl mt-10">
              <div className="">
                Часы работы с&nbsp;8:00&nbsp;до&nbsp;18:00{" "}
              </div>
              <div className="sm:text-lg lg:text-base xl:text-xl">
                Воскресенье - выходной
              </div>
            </div>
          </div>

          <div className="@min-[960px]:hidden @min-[500px]:block hidden  sm:text-xl md:text-2xl lg:text-xl 2xl:text-2xl  bg-slate-200 z-50  p-4 @min-[630px]:p-6  @min-[700px]:p-8  @min-[960px]:px-3 @min-[960px]:py-4 @min-[1000px]:px-4 @min-[1270px]:px-5 @min-[1440px]:px-10 @min-[1550px]:px-12 @min-[1700px]:px-16   @min-[1000px]:py-4 @min-[1200px]:py-4 @min-[1400px]:py-8 @min-[1550px]:py-10 @min-[1680px]:py-14">
            <h3 className="font-[Open-Sans] text-2xl text-sky-800 text-slate 2xl:text-3xl mb-5">
              Суздальская
            </h3>
            <h4 className="sm:text-xl lg:text-base xl:text-lg 2xl:text-xl mb-2">
              Калининград,
              <br /> Суздальская 20 к1&nbsp;п1
            </h4>
            <a href="tel:4012670202">
              <div className="mb-2 mt-5">
                {" "}
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  viewBox="0 0 640 640"
                  className="inline w-6 mb-1 me-1"
                >
                  <path d="M224.2 89C216.3 70.1 195.7 60.1 176.1 65.4L170.6 66.9C106 84.5 50.8 147.1 66.9 223.3C104 398.3 241.7 536 416.7 573.1C493 589.3 555.5 534 573.1 469.4L574.6 463.9C580 444.2 569.9 423.6 551.1 415.8L453.8 375.3C437.3 368.4 418.2 373.2 406.8 387.1L368.2 434.3C297.9 399.4 241.3 341 208.8 269.3L253 233.3C266.9 222 271.6 202.9 264.8 186.3L224.2 89z" />
                </svg>{" "}
                4012 67 02 02
              </div>
            </a>
            <a href="https://wa.me/+79097887766">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 640 640"
                className="w-8 mb-1 me-1 inline"
              >
                <path d="M476.9 161.1C435 119.1 379.2 96 319.9 96C197.5 96 97.9 195.6 97.9 318C97.9 357.1 108.1 395.3 127.5 429L96 544L213.7 513.1C246.1 530.8 282.6 540.1 319.8 540.1L319.9 540.1C442.2 540.1 544 440.5 544 318.1C544 258.8 518.8 203.1 476.9 161.1zM319.9 502.7C286.7 502.7 254.2 493.8 225.9 477L219.2 473L149.4 491.3L168 423.2L163.6 416.2C145.1 386.8 135.4 352.9 135.4 318C135.4 216.3 218.2 133.5 320 133.5C369.3 133.5 415.6 152.7 450.4 187.6C485.2 222.5 506.6 268.8 506.5 318.1C506.5 419.9 421.6 502.7 319.9 502.7zM421.1 364.5C415.6 361.7 388.3 348.3 383.2 346.5C378.1 344.6 374.4 343.7 370.7 349.3C367 354.9 356.4 367.3 353.1 371.1C349.9 374.8 346.6 375.3 341.1 372.5C308.5 356.2 287.1 343.4 265.6 306.5C259.9 296.7 271.3 297.4 281.9 276.2C283.7 272.5 282.8 269.3 281.4 266.5C280 263.7 268.9 236.4 264.3 225.3C259.8 214.5 255.2 216 251.8 215.8C248.6 215.6 244.9 215.6 241.2 215.6C237.5 215.6 231.5 217 226.4 222.5C221.3 228.1 207 241.5 207 268.8C207 296.1 226.9 322.5 229.6 326.2C232.4 329.9 268.7 385.9 324.4 410C359.6 425.2 373.4 426.5 391 423.9C401.7 422.3 423.8 410.5 428.4 397.5C433 384.5 433 373.4 431.6 371.1C430.3 368.6 426.6 367.2 421.1 364.5z" />
              </svg>
              8 909 788 77 66
            </a>
            <div className="sm:text-lg lg:text-base xl:text-lg 2xl:text-xl mt-10">
              <div className="">
                Часы работы с&nbsp;8:00&nbsp;до&nbsp;20:00{" "}
              </div>
              <div className="sm:text-lg lg:text-base xl:text-xl">
                Воскресенье - выходной
              </div>
            </div>
          </div>
          <div className="@min-[960px]:hidden @min-[500px]:block hidden sm:text-xl md:text-2xl lg:text-xl 2xl:text-2xl  bg-slate-200 z-50  p-4 @min-[630px]:p-6  @min-[700px]:p-8  @min-[960px]:px-3 @min-[960px]:py-4 @min-[1000px]:px-4 @min-[1270px]:px-5 @min-[1440px]:px-10 @min-[1550px]:px-12 @min-[1700px]:px-16   @min-[1000px]:py-4 @min-[1200px]:py-4 @min-[1400px]:py-8 @min-[1550px]:py-10 @min-[1680px]:py-14 rounded-br-3xl ">
            <h3 className="font-[Open-Sans] text-2xl text-sky-800 text-slate 2xl:text-3xl mb-5">
              Кутаисская
            </h3>
            <h4 className="sm:text-xl lg:text-base xl:text-lg 2xl:text-xl mb-2">
              Калининград,
              <br /> Кутаисская улица, д.&nbsp;3
            </h4>
            <a href="tel:4012670505">
              <div className="mb-2 mt-5">
                {" "}
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  viewBox="0 0 640 640"
                  className="inline w-6 mb-1 me-1"
                >
                  <path d="M224.2 89C216.3 70.1 195.7 60.1 176.1 65.4L170.6 66.9C106 84.5 50.8 147.1 66.9 223.3C104 398.3 241.7 536 416.7 573.1C493 589.3 555.5 534 573.1 469.4L574.6 463.9C580 444.2 569.9 423.6 551.1 415.8L453.8 375.3C437.3 368.4 418.2 373.2 406.8 387.1L368.2 434.3C297.9 399.4 241.3 341 208.8 269.3L253 233.3C266.9 222 271.6 202.9 264.8 186.3L224.2 89z" />
                </svg>{" "}
                4012 67 05 05
              </div>
            </a>{" "}
            <a href="https://wa.me/+79097952222">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 640 640"
                className="w-8 mb-1 me-1 inline"
              >
                <path d="M476.9 161.1C435 119.1 379.2 96 319.9 96C197.5 96 97.9 195.6 97.9 318C97.9 357.1 108.1 395.3 127.5 429L96 544L213.7 513.1C246.1 530.8 282.6 540.1 319.8 540.1L319.9 540.1C442.2 540.1 544 440.5 544 318.1C544 258.8 518.8 203.1 476.9 161.1zM319.9 502.7C286.7 502.7 254.2 493.8 225.9 477L219.2 473L149.4 491.3L168 423.2L163.6 416.2C145.1 386.8 135.4 352.9 135.4 318C135.4 216.3 218.2 133.5 320 133.5C369.3 133.5 415.6 152.7 450.4 187.6C485.2 222.5 506.6 268.8 506.5 318.1C506.5 419.9 421.6 502.7 319.9 502.7zM421.1 364.5C415.6 361.7 388.3 348.3 383.2 346.5C378.1 344.6 374.4 343.7 370.7 349.3C367 354.9 356.4 367.3 353.1 371.1C349.9 374.8 346.6 375.3 341.1 372.5C308.5 356.2 287.1 343.4 265.6 306.5C259.9 296.7 271.3 297.4 281.9 276.2C283.7 272.5 282.8 269.3 281.4 266.5C280 263.7 268.9 236.4 264.3 225.3C259.8 214.5 255.2 216 251.8 215.8C248.6 215.6 244.9 215.6 241.2 215.6C237.5 215.6 231.5 217 226.4 222.5C221.3 228.1 207 241.5 207 268.8C207 296.1 226.9 322.5 229.6 326.2C232.4 329.9 268.7 385.9 324.4 410C359.6 425.2 373.4 426.5 391 423.9C401.7 422.3 423.8 410.5 428.4 397.5C433 384.5 433 373.4 431.6 371.1C430.3 368.6 426.6 367.2 421.1 364.5z" />
              </svg>
              8 909 795 22 22
            </a>
            <div className="sm:text-lg lg:text-base xl:text-lg 2xl:text-xl mt-10">
              <div className="">
                Часы работы с&nbsp;8:00&nbsp;до&nbsp;19:00{" "}
              </div>
              <div className="sm:text-lg lg:text-base xl:text-xl">
                Воскресенье - выходной
              </div>
            </div>
          </div>
          <div className="map w-full h-full col-span-2 rounded-bl-3xl  mb-3 @min-[500px]:mb-0 overflow-hidden">
            <iframe
              src="https://yandex.ru/map-widget/v1/?um=constructor%3Aab59167b63edbeaae62d59bdc7a13e11a5a0224b543a0a005b589923d2623657&amp;source=constructor"
              className="w-full h-full min-h-90 @min-[510px]:min-h-px  z-50"
              frameborder="0"
            ></iframe>
          </div>

          <div className="@min-[960px]:block @min-[500px]:hidden mb-3 @min-[500px]:mb-0 sm:text-xl md:text-2xl lg:text-xl 2xl:text-2xl  bg-slate-200 z-50  p-4 @min-[630px]:p-6  @min-[700px]:p-8  @min-[960px]:px-3 @min-[960px]:py-4 @min-[1000px]:px-4 @min-[1270px]:px-5 @min-[1440px]:px-10 @min-[1550px]:px-12 @min-[1700px]:px-16   @min-[1000px]:py-4 @min-[1200px]:py-4 @min-[1400px]:py-8 @min-[1550px]:py-10 @min-[1680px]:py-14">
            <h3 className="font-[Open-Sans] text-2xl text-sky-800 text-slate 2xl:text-3xl mb-5">
              Суздальская
            </h3>
            <h4 className="sm:text-lg lg:text-base xl:text-lg 2xl:text-xl mb-2">
              Калининград,
              <br /> Суздальская 20 к1 п1
            </h4>
            <a href="tel:4012670202">
              <div className="mb-2 mt-5">
                {" "}
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  viewBox="0 0 640 640"
                  className="inline w-6 mb-1 me-1"
                >
                  <path d="M224.2 89C216.3 70.1 195.7 60.1 176.1 65.4L170.6 66.9C106 84.5 50.8 147.1 66.9 223.3C104 398.3 241.7 536 416.7 573.1C493 589.3 555.5 534 573.1 469.4L574.6 463.9C580 444.2 569.9 423.6 551.1 415.8L453.8 375.3C437.3 368.4 418.2 373.2 406.8 387.1L368.2 434.3C297.9 399.4 241.3 341 208.8 269.3L253 233.3C266.9 222 271.6 202.9 264.8 186.3L224.2 89z" />
                </svg>{" "}
                4012 67 02 02
              </div>
            </a>
            <a href="https://wa.me/+79097887766">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 640 640"
                className="w-8 mb-1 me-1 inline"
              >
                <path d="M476.9 161.1C435 119.1 379.2 96 319.9 96C197.5 96 97.9 195.6 97.9 318C97.9 357.1 108.1 395.3 127.5 429L96 544L213.7 513.1C246.1 530.8 282.6 540.1 319.8 540.1L319.9 540.1C442.2 540.1 544 440.5 544 318.1C544 258.8 518.8 203.1 476.9 161.1zM319.9 502.7C286.7 502.7 254.2 493.8 225.9 477L219.2 473L149.4 491.3L168 423.2L163.6 416.2C145.1 386.8 135.4 352.9 135.4 318C135.4 216.3 218.2 133.5 320 133.5C369.3 133.5 415.6 152.7 450.4 187.6C485.2 222.5 506.6 268.8 506.5 318.1C506.5 419.9 421.6 502.7 319.9 502.7zM421.1 364.5C415.6 361.7 388.3 348.3 383.2 346.5C378.1 344.6 374.4 343.7 370.7 349.3C367 354.9 356.4 367.3 353.1 371.1C349.9 374.8 346.6 375.3 341.1 372.5C308.5 356.2 287.1 343.4 265.6 306.5C259.9 296.7 271.3 297.4 281.9 276.2C283.7 272.5 282.8 269.3 281.4 266.5C280 263.7 268.9 236.4 264.3 225.3C259.8 214.5 255.2 216 251.8 215.8C248.6 215.6 244.9 215.6 241.2 215.6C237.5 215.6 231.5 217 226.4 222.5C221.3 228.1 207 241.5 207 268.8C207 296.1 226.9 322.5 229.6 326.2C232.4 329.9 268.7 385.9 324.4 410C359.6 425.2 373.4 426.5 391 423.9C401.7 422.3 423.8 410.5 428.4 397.5C433 384.5 433 373.4 431.6 371.1C430.3 368.6 426.6 367.2 421.1 364.5z" />
              </svg>
              8 909 788 77 66
            </a>
            <div className="sm:text-lg lg:text-base xl:text-lg 2xl:text-xl mt-10">
              <div className="">
                Часы работы с&nbsp;8:00&nbsp;до&nbsp;20:00{" "}
              </div>
              <div className="sm:text-lg lg:text-base xl:text-xl">
                Воскресенье - выходной
              </div>
            </div>
          </div>
          <div className="@min-[960px]:block @min-[500px]:hidden sm:text-xl md:text-2xl lg:text-xl 2xl:text-2xl  bg-slate-200 z-50   p-4 @min-[630px]:p-6  @min-[700px]:p-8 @min-[960px]:px-3 @min-[960px]:py-4 @min-[1000px]:px-4 @min-[1270px]:px-5 @min-[1440px]:px-10 @min-[1550px]:px-12 @min-[1700px]:px-16   @min-[1000px]:py-4 @min-[1200px]:py-4 @min-[1400px]:py-8 @min-[1550px]:py-10 @min-[1680px]:py-14 rounded-br-3xl ">
            <h3 className="font-[Open-Sans] text-2xl text-sky-800 text-slate 2xl:text-3xl mb-5">
              Кутаисская
            </h3>
            <h4 className="sm:text-lg lg:text-base xl:text-lg 2xl:text-xl mb-2">
              Калининград,
              <br /> Кутаисская улица, д. 3
            </h4>{" "}
            <a href="tel:4012670505">
              <div className="mb-2 mt-5">
                {" "}
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  viewBox="0 0 640 640"
                  className="inline w-6 mb-1 me-1"
                >
                  <path d="M224.2 89C216.3 70.1 195.7 60.1 176.1 65.4L170.6 66.9C106 84.5 50.8 147.1 66.9 223.3C104 398.3 241.7 536 416.7 573.1C493 589.3 555.5 534 573.1 469.4L574.6 463.9C580 444.2 569.9 423.6 551.1 415.8L453.8 375.3C437.3 368.4 418.2 373.2 406.8 387.1L368.2 434.3C297.9 399.4 241.3 341 208.8 269.3L253 233.3C266.9 222 271.6 202.9 264.8 186.3L224.2 89z" />
                </svg>{" "}
                4012 67 05 05
              </div>
            </a>
            <a href="https://wa.me/+79097952222">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 640 640"
                className="w-8 mb-1 me-1 inline"
              >
                <path d="M476.9 161.1C435 119.1 379.2 96 319.9 96C197.5 96 97.9 195.6 97.9 318C97.9 357.1 108.1 395.3 127.5 429L96 544L213.7 513.1C246.1 530.8 282.6 540.1 319.8 540.1L319.9 540.1C442.2 540.1 544 440.5 544 318.1C544 258.8 518.8 203.1 476.9 161.1zM319.9 502.7C286.7 502.7 254.2 493.8 225.9 477L219.2 473L149.4 491.3L168 423.2L163.6 416.2C145.1 386.8 135.4 352.9 135.4 318C135.4 216.3 218.2 133.5 320 133.5C369.3 133.5 415.6 152.7 450.4 187.6C485.2 222.5 506.6 268.8 506.5 318.1C506.5 419.9 421.6 502.7 319.9 502.7zM421.1 364.5C415.6 361.7 388.3 348.3 383.2 346.5C378.1 344.6 374.4 343.7 370.7 349.3C367 354.9 356.4 367.3 353.1 371.1C349.9 374.8 346.6 375.3 341.1 372.5C308.5 356.2 287.1 343.4 265.6 306.5C259.9 296.7 271.3 297.4 281.9 276.2C283.7 272.5 282.8 269.3 281.4 266.5C280 263.7 268.9 236.4 264.3 225.3C259.8 214.5 255.2 216 251.8 215.8C248.6 215.6 244.9 215.6 241.2 215.6C237.5 215.6 231.5 217 226.4 222.5C221.3 228.1 207 241.5 207 268.8C207 296.1 226.9 322.5 229.6 326.2C232.4 329.9 268.7 385.9 324.4 410C359.6 425.2 373.4 426.5 391 423.9C401.7 422.3 423.8 410.5 428.4 397.5C433 384.5 433 373.4 431.6 371.1C430.3 368.6 426.6 367.2 421.1 364.5z" />
              </svg>
              8 909 795 22 22
            </a>
            <div className="sm:text-lg lg:text-base xl:text-lg 2xl:text-xl mt-10">
              <div className="">
                Часы работы с&nbsp;8:00&nbsp;до&nbsp;19:00{" "}
              </div>
              <div className="sm:text-lg lg:text-base xl:text-xl">
                Воскресенье - выходной
              </div>
            </div>
          </div>
          <div className="@min-[500px]:hidden mb-3   ps-4  pt-4">
            <h3 className="text-3xl xl:text-4xl 2xl:text-5xl font-[Open-Sans] font-medium">
              Контакты
            </h3>
          </div>
        </div>
      </div>
    </div>
  );
}

export default Map;
